Revit 2027 API
GroupTypeId.RailingSystemSegmentPatternRepeat Property
 Pattern Repeat.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingSystemSegmentPatternRepeat { get; }
Public Shared ReadOnly Property RailingSystemSegmentPatternRepeat As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingSystemSegmentPatternRepeat {
	ForgeTypeId^ get ();
}
static member RailingSystemSegmentPatternRepeat : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace